[["1",0," ^i[A Manual of Abhidhamma. Abhidhammattha Sangaha: An Outline of Buddhist Philosophy. ]Fourth  revised edition 1979. Kuala Lumpur, Malaysia: The Buddhist Missionary Society."],
["2",0,"Śri Lanka, late twelfth century."],
["3",0,"Burma (Myanmar), first published in 1897."],
["4",0," ^i[Paññābhūmi], XIV—XVII."],
["5",0,"According to the Theravādin school, the Pāḷi Canon contains the genuine utterances of the Buddha (and several of His disciples). The Theravādins maintain that their school alone is orthodox and that all other schools are degenerations and corruptions of the original teaching."],
["6",0,"Modern Patna."],
["7",0,"“Pāḷi” literally means “line, row,” hence, “text.”"],
["8",0,"Sanskrit ^i[sūtra ]“discourse, teaching.”"],
["9",0,"Tenth century C.E."],
["10",0,"Eleventh century C.E."],
["11",0,"^i[Aṭṭhasālinī ](commentary to ^i[Dhammasangaṇī]) 2; ^i[The  Expositor ](translation of the ^i[Aṭṭhasālinī]), p. 3."],
["12",0,"^i[Aṭṭhasālinī ]2—3; ^i[The  Expositor], pp. 3—4."],
["13",0,"The ^i[Dhammasangaṇī ]also includes a Suttanta matrix consisting of forty-two dyads taken from the Suttas. However, this is ancillary to the Abhidhamma proper and serves more as an appendix for providing succinct definitions of key Suttanta terms. Moreover, the definitions themselves are not framed in terms of Abhidhamma categories, and the Suttanta matrix is not employed in any subsequent books of the Abhidhamma Piṭaka."],
["14",0,"See, for example, the following works: A. K. Warder, ^i[Indian Buddhism], 2nd revised edition (Delhi: Motilal Banarsidass 〔1980〕), pp. 218—224; Fumimaro Watanabe, ^i[Philosophy and its Development in the Nikāyas and Abhidhamma ](Delhi: Motilal Banarsidass 〔1983〕), pp. 18—67; and the article “Abhidhamma Literature” by Kogen Mizuno in ^i[Encyclopaedia of Buddhism], Fasc. 1 (Government of Ceylon 〔1961〕)."],
["15",0,"^i[Aṭṭhasālinī ]410; ^i[The  Expositor], p. 519."],
["16",0,"Namely, the ^i[Dhammasangaṇī], the ^i[Vibhanga], the ^i[Dhātukathā], the ^i[Puggalapaññati], the ^i[Yamaka], and the ^i[Paṭṭhāna], but not the detailed refutation of deviant views found in the ^i[Kathāvatthu], which is attributed to the Elder Moggaliputta Tissa, who presided over the Third Council, which was convened in Patna by the Emperor Asoka in the middle of the third century B.C.E."],
["17",0,"^i[Aṭṭhasālinī ]13; ^i[The  Expositor], p. 16—17."],
["18",0,"^i[Aṭṭhasālinī ]16; ^i[The  Expositor], p. 20."],
["19",0,"For example, the first book of the Sārvastivādin Abhidharma, the ^i[Sangītiparyāya], is ascribed to Sāriputta by Chinese sources (but not by Sanskrit and Tibetan sources), while the second book, the ^i[Dharmaskandha], is ascribed to him by Sanskrit and Tibetan sources (but not by Chinese sources). The Chinese canon also contains a work entitled ^i[Śāriputra Abhidharma Śāstra], the origin of which is unknown."],
["20",0,"These are reduced to the familiar eighty-nine ^i[cittas ]by grouping together the five ^i[cittas ]into which each path and fruition consciousness is divided by association with each of the five ^i[jhānas]."],
["21",0,"The ^i[Yamaka], in its chapter “Citta-yamaka,” uses the term ^i[khaṇa ]to refer to the subdivisions of a moment and also introduces the ^i[uppāda-khaṇa ]and ^i[bhanga-khaṇa], the sub-moments of arising and dissolution. However, the threefold scheme of sub-moments seems to appear first in the Commentaries."],
["22",0,"Venerable Devananda Adhikarana Nayaka Thero, in the Preface to ^i[Paramattha-vinicchaya and Paramattha-vibhāvinī-vyākhyā ](Ceylon: Vidyā Sāgara Press 〔1926〕), p. iii."],
["23",0,"G. P. Malalasekera, ^i[The Pāḷi Literature of Ceylon ](Colombo: M. D. Gunasena 〔reprinted 1959〕), pp. 168—170. Malalasekera points out that James Gray in his edition of the ^i[Buddhaghosuppatti], gives a chronological list of saintly and learned men of Southern India, taken from the Talaing records, and there we find Anuruddha mentioned after authors who are supposed to have lived later than the seventh or eighth century. Since Bhadanta Sāriputta Mahāsāmi compiled a Sinhalese paraphrase of the ^i[Abhidhammattha Sangaha ]during the reign of Parākrama-Bāhu the Great (1164—1197 C.E.), this places Anuruddha earlier than the middle of the twelfth century C.E."],
["24",0,"See the article “Anuruddha (5)” in ^i[Encyclopaedia of Buddhism], Fasc. 4 (Government of Ceylon, 1965). Venerable Buddhadatta’s view is also accepted by Warder, ^i[Indian Buddhism], pp. 533—534."],
["25",0,"This author is commonly confused with another Burmese monk called Chapada, who came to Śri Lanka during the twelfth century C.E. and studied under Bhadanta Sāriputta. The case for two Chapadas is cogently argued by Venerable A. P. Buddhadatta, ^i[Corrections to Geiger’s Mahāvaṁsa, Etc. ](Amba- langoda: Ananda Book Co. 〔1957〕), pp. 198—209."],
["26",0," ^i[Paramassa uttamassa ñāṇassa attho gocaro]. ^i[Vibhāvinī-Ṭīkā]."],
["27",0," According to the ^i[Vibhāvinī-Ṭīkā], ^i[diṭṭhigata ]denotes just wrong view, the suffix ^i[gata ]having no particular meaning here."],
["28",0," In the Suttas, the term ^i[saṁkhāra ](^i[sankhāra], ^i[saṅkhāra]) has, according to context, different shades of meaning, which should be carefully distinguished. (1) In its most frequent usages, the general term “formation” may be applied, with the qualifications required by the context. This term may refer either to the act of “forming” or to the passive state of “having been formed” or to both. (A) As the second link of the  formula  of  Dependent  Arising  (^i[paṭiccasamuppāda]),  ^i[saṁkhāra   ]has  the  active  aspect,  “forming,”  and signifies ^i[kamma], that is, the wholesome or unwholesome volitional activity (^i[cetanā]) of body (^i[kāya- saṁkhāra]), speech (^i[vacīsaṁkhāra]), or mind (^i[cittasaṁkhāra ]or ^i[manosaṁkhāra]). (B) The aforementioned three terms, ^i[kāyasaṁkhāra], ^i[vacīsaṁkhāra], and ^i[cittasaṁkhāra], are sometimes used in quite a different sense, namely, (i) as bodily function, that is, in-and-out-breathing, (ii) as verbal function, that is, thought- conception and discursive thinking, and (iii) as mental function, that is, feeling and perception. (C) ^i[Saṁkhāra ]also denotes the fourth aggregate and includes all mental formations, whether they belong to “karmically forming” consciousness or not. (D) ^i[Saṁkhāra ]occurs further in the sense of anything formed or conditioned and includes all things whatever in the world — all phenomena of existence. (2) ^i[Saṁkhāra ]sometimes also means “volitional effort.” Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist  Terms and Doctrines ](fourth revised edition 〔1980〕), pp. 190—192."],
["29",0,"(1) ^i[vici- ](^i[vicinanto]) = “inquiring” + ^i[kicch- ]“to be vexed;” (2) ^i[vi- ]= “devoid of” + ^i[cikicchā ]= “remedy.”"],
["30",0,"That is, matter that responds to sense stimuli — the five physical sense organs."],
["31",0,"This is the turning of the mind towards an object. ^i[Āvajjana ]forms the first stage in the process of consciousness. When an object of the five physical senses is involved, it is called “five-sense-door adverting consciousness” (^i[pañcadvārāvajjanacitta]); in the case of a mental object, “mind-door adverting consciousness” (^i[manodvārāvajjanacitta]). Cf, Nyanatiloka, ^i[Buddhist Dictionary: Manual of  Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), pp. 30—31. The process of the inner, or mind, consciousness, that is, without participation of the five physical senses, is as follows: in the case that the mind-object entering the mind-door is distinct, then it passes through the stages of “adverting at the mind-door” (^i[manodvārāvajjana]), “the impulsive stage,” and “the registering stage,” before finally sinking into the subconscious stream. Cf, Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines] (fourth revised edition 〔1980〕), pp. 227—228."],
["32",0," A single unit of sense perception (for example, visual consciousness), being conditioned through a sense organ and its corresponding object, forms in reality an extremely complex process, in which all the single phases of consciousness follow one another in rapid succession, performing their respective functions, for example:“As soon as a visible object has entered the range of vision, it acts on the sensitive eye-organ (^i[cakkhu-pasāda]), and, conditioned thereby, an excitation of the subconscious stream (^i[bhavanga-sota]) takes place.\n“As soon, however, as subconsciousness is broken off, the functional mind element, grasping the object and breaking through the subconscious stream, performs the function of ‘adverting’ (^i[āvajjana]) the mind towards the object.\n“Immediately thereupon, there arises at the eye-door, and based upon the sensitive eye-organ, the eye-consciousness, while performing the function of ‘seeing’ (^i[dassana])…\n“Immediately thereafter, there arises the mind-element, performing the function of ‘receiving’ (^i[sampaṭicchana]) the object of that consciousness…\n“Immediately thereafter, there arises…the mind-consciousness element, while ‘investigating’ (^i[santīraṇa]) the object received by the mind-element…\n“Immediately thereafter, there arises the functional, rootless mind-consciousness-element, accompanied by indifference, while performing the function of ‘determining’ (^i[votthapana]) the object…\n“Now, if the object is large, then immediately afterwards there flash forth six or seven ‘impulsive moments’ (^i[javana-citta]), constituted by one of the eight wholesome (^i[kusala]) or twelve unwholesome (^i[akusala]) or nine functional (^i[kiriya] or ^i[kriyā]) classes of consciousness.\n“Now, if, at the end of the impulsive moments, the object at the five-sense doors is very large and at the mind-door clear, then there arises, once or twice, one of the eight root-accompanied ^i[kamma]-resultant classes of consciousness of the sense-sphere, or one of the three rootless ^i[kamma]-resultant mind- consciousness-elements…\nBecause this consciousness, after the vanishing of the impulsive moments, possesses the faculty continuing with the object of the subconsciousness, taking the object of the subconsciousness as its own object, thereby, it is called ‘registering’ (^i[tadārammaṇa], literally, ‘that object’ or ‘having that as object’).” (^i[Visuddhimagga] XIV, 115ff.)\nIf, however, the sense-object is weak, then it reaches merely the stage of “impulsion” (^i[javana]), or of “determining” (^i[votthapana]); if very weak, only an excitation of the subconsciousness takes place."],
["33",0," ^i[Kiriya ](or ^i[kriyā]) ^i[citta], “functional consciousness” or “karmically inoperative consciousness,” is the name for such states of consciousness that are neither karmically wholesome (^i[kusala]), nor unwholesome (^i[akusala]), nor ^i[kamma]-results (^i[vipāka]); that is, they function independently of ^i[kamma]. Thus are also called all those worldly mental states in the Arahant that are accompanied by two or three noble roots (non-greed, non-hatred, non-delusion), being karmically neutral in an Arahant and corresponding to the karmically wholesome states of a non-Arahant, as well as the rootless joy-producing (^i[hasituppāda]) mind- consciousness-element of an Arahant; further, that mind-element (^i[mano-dhātu]) that performs the function of adverting (^i[āvajjana]) to the sense object, and that mind-consciousness element (^i[manoviññāṇa-dhātu]) that performs the function of deciding (^i[votthapana]) and adverting to the mental object. The last-named two elements, of course, occur in all beings. \nTogether with ^i[kamma]-resultant consciousness (^i[vipāka]), it belongs to the group of “karmically neutral consciousness” (^i[abyākata]). Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines] (fourth revised edition 〔1980〕), pp. 103—104."],
["34",0,"  Sometimes  also  called  ^i[rūpajjhānas],  “fine-material  absorptions,”  to  distinguish  them  from  the"],
["35",0," ^i[Ārammaṇ’upanijjhānato paccanīkajjhāpanato jhānaṁ]. ^i[Visuddhimagga ]IV, 119."],
["36",0,"The “hindrances” are five qualities that are obstacles to the mind and block one’s mental vision. One cannot reach either neighborhood concentration (^i[upacāra-samādhi]) or full concentration (^i[appanā-samādhi]) when the hindrances are present, and one cannot clearly discern the truth. The hindrances are: desire for gratification of the senses (^i[kāmacchanda]), ill will (^i[vyāpāda]), sloth and torpor (^i[thīna-middha]), restlessness and worry (^i[uddhacca-kukkucca]), and skeptical doubt (^i[vicikicchā]). The overcoming of these five  hindrances in ^i[jhāna ]is merely a temporary suspension, called “overcoming through repression” (^i[vikkhambhana-pahāna]). They disappear forever when one enters the four supramundane paths, that is, skeptical doubt on reaching ^i[Sotāpanna]; desire for gratification of the senses (sensory desire), ill will, and mental worry on reaching ^i[Anāgāmi]; sloth, torpor, and restlessness on reaching ^i[Arahant]. Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), pp. 129— 130."],
["37",0,"^i[So  hi  ārammaṇe  cittaṁ  āropeti.   Aṭṭhasālinī ]114."],
["38",0," ^i[Visuddhimagga ]IV, 89—91."],
["39",0,"In ^i[The Path of Purification], his translation of the ^i[Visuddhimagga], Bhikkhu Ñāṇamoli has translated it as “happiness.” This rendering is often used for ^i[sukha], the next factor, and thus may lead to confusion of the two."],
["40",0," ^i[Visuddhimagga ]IV, 94—100."],
["41",0,"For a detailed elaboration of this simile, see ^i[Aṭṭhasālinī ]117—118; ^i[The  Expositor], pp. 155—156."],
["42",0,"This qualification is made in regard to the path of once-returning (as explained below)."],
["43",0,"For details, cf. Henepola Gunaratana, ^i[The Jhānas in Theravāda Buddhist Meditation ](Kandy, Śri Lanka: Buddhist Publication Society 〔1988〕). Wheel no. 351/353, pp. 60—62."],
["44",0,"^i[Aṭṭhasālinī ]67; ^i[The  Expositor], p. 90."],
["45",0," ^i[Kāyaviññatti], ^i[vacīviññatti]. See Chapter 6, §3."],
["46",0,"On the bases, see Chapter 3, §§20—22."],
["47",0,"See Chapter 1, §3."],
["48",0,"The following explanations of the characteristics, etc., of the different ^i[cetasikas ]have been collected from the ^i[Visuddhimagga ]IV, 88—100; IX, 93—96; XIV, 134—177; and ^i[Aṭṭhasālinī ]107—133, 247—260.  See"],
["49",0,"So say the Commentaries. But it seems that tranquility as proximate cause applies solely to the pleasant feeling when developing concentration. A more general proximate cause for feeling would be contact, in accordance with the principle “with contact as condition, feeling comes to be” (^i[phassapaccayā vedanā]). In fact, the entire treatment of feeling here is limited to a particular kind of feeling. For a fuller treatment of feeling in all its variety, see Chapter 3, §§2—4, and Guide."],
["50",0,"Again, these last two commentarial statements seem fitting only for one-pointedness that has reached the level of profound concentration."],
["51",0,"See above, Chapter 1, Guide to §§18—20, initial application."],
["52",0,"Or the mounting of the mind onto the object (^i[ārammaṇe cittassa abhiniropana])."],
["53",0,"Or continued stroking of the object (^i[ārammaṇ’ānumajjana])."],
["54",0,"In the Suttas, ^i[chanda ]is often used as a synonym for ^i[lobha ]and ^i[rāga], thus, as meaning “desire” in the reprehensible sense as well. But the Suttas also recognize ^i[chanda ]as a potentially beneficial factor, as  when they speak about the arousing of desire for the abandoning of unwholesome states and for the acquisition of wholesome states. See, for example, the definition of right effort at ^i[Dīgha Nikāya ]22/ii, 312 (= ^i[Majjhima Nikāya ]141/iii, 251—252).\nAs an unwholesome quality, ^i[chanda] has the meaning of “desire” and is frequently coupled with the terms for “lust,” “greed,” etc., for instance, ^i[kāma-chanda] “sensory desire,” one of the five hindrances; ^i[rāga-chanda] “lustful desire.” When used in the sense of an unwholesome quality, ^i[chanda] is one of the four wrong paths. \nAs a wholesome quality, ^i[chanda] is a righteous will or zeal (^i[dhamma-chanda]) and occurs, for example, in the formula of the four right efforts: “The monk rouses his will (^i[chandaṁ janeti])…” If intensified, this type of ^i[chanda] is one of the four roads to power. Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines] (fourth revised edition 〔1980〕), p. 48."],
["55",0,"As an ethically neutral psychological term, in the sense of “intention,” ^i[chanda ]is one of those general mental factors (^i[cetasika]) taught in the Abhidhamma, the moral quality of which is determined by the character of the volition (^i[cetanā]). The Commentary explains it as “a wish to do” (^i[kattu-kamyatā-chanda]). If intensified, it acts also as “a predominance condition.”"],
["56",0,"Inasmuch as these two factors are the opposites of shame and fear of wrongdoing, their meaning can be more fully understood by contrast with these beautiful factors — see below, Guide to §5, shame and fear of wrongdoing."],
["57",0,"Since seeing the noble ones leads to hearing the true Dhamma, which can prevent wrong view from getting a grip on the mind."],
["58",0," ^i[Ketukamyatā], literally, “a desire to fly the banner (to advertise oneself).”"],
["59",0,"Because conceit arises only in greed-rooted ^i[cittas ]dissociated from views."],
["60",0,"For the nine grounds for annoyance (or causes of malice, ^i[aghātavatthu]), see ^i[Dīgha Nikāya ]33/iii, 262."],
["61",0,"“There are five kinds of stinginess (^i[macchariya]), O Monks: regarding the dwelling place, regarding families, regarding gain, regarding recognition, and regarding mental things” (^i[Anguttara Nikāya], IX, 49; ^i[Puggalapaññatti ]56)."],
["62",0,"Whenever ^i[kukkucca ]arises, it is associated with hateful (discontented) consciousness. It is “the repentance over wrong things done and right things neglected.” Restlessness and worry (^i[uddhacca- kukkucca]), combined, are counted as one of the five mental hindrances (^i[nīvaraṇa])."],
["63",0,"A Buddhist is said to have ^i[saddhā ]if “he believes in the Perfect One’s Enlightenment” or in the Three Jewels (^i[ti-ratana]) by taking refuge in them. His faith, however, should be “reasoned and rooted in understanding,” and he is asked to investigate and test the object of his faith. A Buddhist’s faith is not in conflict with the spirit of inquiry — “doubt about dubitable things” is admitted, and inquiry into them is encouraged. The “faculty of faith” (^i[saddhindriya]) should be balanced with that of wisdom (^i[paññindriya]). Through faith and understanding, faith becomes an inner certainty and firm conviction based upon one’s own experience. \nFaith is called the seed of all wholesome states, because, according to commentarial explanations, it inspires the mind with confidence and determination for “launching out” to cross the flood of ^i[saṁsāra].\nUnshakable faith is attained on reaching the first stage of holiness, Stream-Entry (^i[sotāpatti]), when the fetter of skeptical doubt (^i[vicikicchā]) is eliminated.\nUnshakable confidence (^i[avecca-pasāda]) in the Three Jewels (the Buddha, the Dhamma, and the Sangha) is one of the characteristics of a Stream-Winner (^i[sotāpannassa angāni]).\nCf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines] (fourth revised edition 〔1980〕), pp. 181—182."],
["64",0,"The complete version of these similes is found in the ^i[Milindapañha], cited at ^i[Aṭṭhasālinī ]119—120.  See ^i[The Expositor], pp. 157—158. "],
["65",0," ^i[Apilāpanna], also rendered “not wobbling.” The commentators explain that ^i[sati ]keeps the mind as steady as a stone instead of letting it bob about like a pumpkin in water."],
["66",0,"^i[Aṭṭhasālinī ]103—104; ^i[the  Expositor], pp. 136—137."],
["67",0,"It should be noted that, while compassion involves empathy with those beset by suffering, it is never accompanied by sadness or sorrow, which is a feeling pertaining only to unwholesome ^i[cittas]."],
["68",0,"While non-hatred and mental neutrality are found in the supramundane ^i[cittas], they do not occur there as the illimitables of loving-kindness and equanimity towards beings."],
["69",0,"Tranquility (^i[passaddhi]), it seems, is the proximate cause only for joyful feeling that arises in meditative development."],
["70",0,"On the heart-base, see below, §20."],
["71",0,"These definitions of the five feelings are found at ^i[Visuddhimagga ]XIV, 128."],
["72",0," ^i[Aṭṭhasālinī ]263; ^i[The  Expositor], pp. 349-350.  The five types of sensitivity are considered types of derived matter (^i[upādāya-rūpa]), as are the first four sense objects. The tangible object, however, consists of three primary elements. See Chapter 6, §3. According to Nyanatiloka,  ^i[upādāya-rūpa],  “derived  matter,” signifies the twenty-four secondary corporeal phenomena dependent upon the four primary physical elements, that is, the sense organs and the sense objects. Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), p. 216. Further, ^i[upādāya-rūpa ]is, as such,  an Abhidhamma term, but it is used with the same meaning in the Sutta texts as in, for example, ^i[Majjhima Nikāya ]9: ^i[catunnañ ca mahābhūtānaṁ upādāya rūpaṁ]. Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual  of  Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), p. 254."],
["73",0,"See the explanation of ^i[javana ]in §8 below. Mental pleasure does precede the ^i[javana ]phase in the joyful investigating consciousness that arises in the case of an exceptionally pleasant object, but this, too, follows the bare sense consciousness."],
["74",0,"^i[Suppatiṭṭhitabhāvasādhanasankhāto  mūlabhāvo].  ^i[Vibhāvinī  Ṭīkā]."],
["75",0," ^i[Visuddhimagga ]XVII, 70."],
["76",0,"That is, in the five-door process. In a mind-door process, the ^i[javana ]phase follows the mind-door adverting consciousness."],
["77",0," This is so in the case of non-Arahants. For Arahants, the ^i[javanas ]are ethically indeterminate. ^i[Javana ]is treated more fully in Chapter 4."],
["78",0," ^i[Puthujjana], literally, “one of the many folk,” “worldling,” “ordinary person,” is any lay person or monk who is still possessed of all the ten fetters (^i[saṁyojana]) that bind one to the round of rebirths (^i[saṁsāra]) and who, therefore, has not yet reached any of the four stages of holiness (^i[ariya-puggala]).\nAccording to the Commentary to the ^i[Majjhima Nikāya] 9, a “worldling” may be (1) an outsider (a non-Buddhist) who, if he believes in moral causation, may be said to have Right View to that extent; but he does not have the knowledge confirming the truths (^i[saccānulomika-ñāṇa]), as has (2) the worldling “inside the Buddha’s dispensation” (^i[sāsanika]). A worldling who professes Buddhism may be either “a blind worldling” (^i[andha-puthujjana]), who has neither knowledge of, nor interest in the fundamental Teachings (the Four Noble Truths, the Five Aggregates, Dependent Origination, etc.), or he is “a noble worldling” (^i[kalyāṇa-puthujjana]), who has such knowledge and earnestly strives to understand and practice the Teachings. Cf. Nyanatiloka, Buddhist Dictionary: Manual of Buddhist Terms and Doctrines  (fourth revised edition 〔1980〕), pp. 172—173."],
["79",0," ^i[Sekha ]= “a noble learner,” a disciple in higher training, that is, one who pursues the three kinds of training (^i[sikkhā]), is one of those seven kinds of noble disciples (^i[ariya-puggala]) who have reached one of the four supramundane paths or the three lower fruitions, while the one possessed of the fourth fruition, or ^i[Arahatta-phala], is called “one beyond training” (^i[asekha], literally, “no more learner”). The worldling is called “neither a noble learner, nor perfected in learning” (^i[n’eva-sekha-nāsekha]). Cf. Nyanatiloka,  ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), p. 198."],
["80",0," That is, the four ^i[cittas ]rooted in greed and accompanied by wrong view and the ^i[citta ]accompanied by doubt will be absent in the Stream-Enterer and Once-Returner, while the two ^i[cittas ]rooted in hatred will be absent in the Non-Returner."],
["81",0," The word ^i[rūpa ]has two primary meanings: (1) matter, or materiality; and (2) visible form. The former is a generic category within which the latter is included as a type."],
["82",0,"The distinction between primary matter and derived matter will be dealt with more fully in Chapter 6, §2."],
["83",0,"See ^i[Visuddhimagga ]VIII, 111."],
["84",0,"For the mind-door process, the heart-base is only required in those realms where matter is found. While  a mind-door process can also take any of the five sense data as object, mental object is listed to show its distinctive datum."],
["85",0,"An exception, however, is made for bodily and verbal intimation and for the four material characteristics (see Chapter 6, §4). The two types of intimation have the temporal duration of one mind-moment. Of the four characteristics, production and continuity are equal in duration to the arising moment, impermanence to the dissolution moment, and decay to forty-nine sub-moments of mind."],
["86",0,"The simile is introduced in ^i[Aṭṭhasālinī ]271—272, ^i[Expositor], pp. 359—360, however, without continuing beyond the eating of the mango. Later tradition (as in ^i[Vibhāvinī-Ṭīkā]) adds the swallowing of the fruit and going back to sleep as counterparts of registration and the lapse back into the ^i[bhavanga]."],
["87",0,"See ^i[Visuddhimaga ]XXII, 23, note 7."],
["88",0," ^i[Samohavinodanī ]10—11; ^i[Dispeller of Delusion], 1:10—11."],
["89",0," ^i[Sammohavinodanī ]10—11; ^i[Dispeller of Delusion], 1:10—11."],
["90",0,"Though the logic of the temporal sequence seems to imply that, in the case of the Brahmā realms, too, the ^i[mahākappa ]is intended, the commentators base their interpretation upon another tradition (derived from the Suttas), which holds that the periodic destruction of the world by fire extends through the realm of ^i[Mahā Brahmās]. Since this destruction takes place at the end of one ^i[asankheyyakappa ]within the ^i[mahākappa], the conclusion follows that the ^i[Mahā Brahmās ]cannot live longer than a single ^i[asankheyyakappa]. The sources for this other tradition are ^i[Dīgha Nikāya ]1/i, 17—18, and ^i[Dīgha Nikāya ]27/iii, 84—85."],
["91",0," For a detailed analysis of the ten course of action, see ^i[Aṭṭhasālinī ]97—102; ^i[Expositor], pp. 128—135."],
["92",0,"These three views are found at ^i[Dīgha Nikāya ]2, ^i[Majjhima Nikāya ]60, ^i[Majjhima Nikāya ]76, and elsewhere. For the commentarial analysis, see Bhikkhu Bodhi, ^i[The Discourse on the Fruits of Recluseship ](Buddhist Publication Society, 1989), pp. 69—83."],
["93",0," According to the ^i[Mahāniddesa]:  ^i[ruppati], ^i[kuppati], ^i[ghaṭṭīyati], ^i[pīḷīyati], ^i[bhijjati]."],
["94",0," ^i[Sītoṇhādi-virodhippaccayehi vikāraṁ āpajjati āpādiyati]. ^i[Vibhāvinī-Ṭīkā]."],
["95",0," This explanation of the characteristics, etc., of the great essentials is taken from the ^i[Visuddhimagga ]XI, 93 and 109."],
["96",0," A detailed exposition of derived matter is found at ^i[Visuddhimagga ]XIV, 36—70, on which the account given here is based."],
["97",0," Here, the prefix ^i[sa-], ‘with’, does not imply association (^i[sampayutta]) but the ability to be made an object of the taints."],
["98",0," The Brahmajāla Sutta (^i[Dīgha Nikāya ]1) enumerates 62 kinds of wrong views concerning the nature of the self and the world. These all fall into the two extreme views of eternalism, which affirms their eternal existence, and annihilationism, which posits their eventual destruction."],
["99",0," For a detailed account, cf. Ledi Sayādaw, ^i[The Requisites of Enlightenment ](Kandy: Buddhist Publication Society, ^i[Wheel ]no. 171/174 〔1971〕)."],
["100",0," For the ^i[suttas ]and their commentaries, cf. Soma Thera, ^i[The Way of Mindfulness ](Kandy: Buddhist Publication Society 〔1981〕). The best modern expositions are Nyanaponika Thera, ^i[The Heart of Buddhist Meditation ](York Beach, ME: Samuel Weiser 〔1965〕) and U Silānanda, ^i[The Four Foundations of Mind- fulness ](Boston, MA: Wisdom Publications 〔1990〕)."],
["101",0," The hindrances are five qualities that are obstacles to the mind and that blind our mental vision. When they are present, we cannot reach neighborhood concentration (^i[upacāra-samādhi]) and full concentration (^i[appāna-samādhi]) and are unable to discern the truth clearly. The five hindrances are: (1) desire for gratification of the senses (^i[kāmacchanda]); (2) ill will / hatred / aversion (^i[vyāpāda]); (3) sloth and torpor (^i[thīna-middha]); (4) restlessness and worry (^i[uddhacca-kukkucca]); and (5) skeptical doubt (^i[vicikicchā]). Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), pp. 129—130."],
["102",0," The seven factors of enlightenment are (see below, §29): (1) mindfulness (^i[satisambojjhanga]); (2) investigation of the truth (^i[dhammavicaya]), that is, insight into mental and material phenomena as they really are; (3) energy / effort (^i[viriya]); (4) zest / bliss / joy / rapture (^i[pīti]); (5) tranquility (^i[passaddhi]); (6) concentration (^i[samādhi]); and (7) equanimity (^i[upekkhā]). Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), pp. 41—42."],
["103",0," The explanation given here is derived from Ledi Sayādaw (^i[Paramatthadīpanī-Ṭīkā], “The Elucidation of the Ultimate Meaning”). The view expressed by Venerable Nārada in the previous editions of this ^i[Manual], that the ^i[iddhipādas ]are solely supramundane, appears to be mistaken."],
["104",0," The four qualities of a stream-enterer (^i[sotāpanna]) are: (1) unshakable faith towards the Enlightened  One (^i[Buddha]); (2) unshakable faith towards the Doctrine (^i[Dhamma]); (3) unshakable faith towards the Order (^i[Sangha]); and (4) perfect morality (^i[sīla]). The four (preliminary) “conditions to stream-entry” (^i[sotāpattiyanga]) are: (1) companionship with good persons; (2) hearing the Doctrine (^i[Dhamma]); (3) wise reflection; and (4) living in conformity with the Doctrine. Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual  of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), p. 203."],
["105",0," The four right efforts form the sixth stage of the Noble Eightfold Path (see above, §25)."],
["106",0," See above, §24."],
["107",0," The four fine-material absorptions are achieved through the attainment of full concentration, during which there is a complete, though temporary, suspension of five-fold sense-activity and the five hindrances (see above, fn. 101). The state of consciousness, however, is one of full alertness and lucidity. This high degree of concentration is generally developed by practice of one of the forty subjects of tranquility meditation  (^i[samatha-kammaṭṭhāna]).   Cf.  Nyanatiloka,  ^i[Buddhist    Dictionary:     Manual    of    Buddhist    Terms  and Doctrines ](fourth revised edition 〔1980〕), pp. 83—84. For more information on the absorptions (^i[jhāna]), cf. Mahāthera Henepola Gunaratana, ^i[The Jhānas in Theravāda Buddhist Meditation ](Kandy: Buddhist Publication Society 〔1988〕)."],
["108",0," The universal moral law (^i[Dhamma]) discovered by the Buddha is summed up in the Four Noble Truths:(1) the truth about the universal sway of suffering (^i[dukkha]); (2) about its origin (^i[samudaya]); (3) its cessation (^i[nirodha]); and (4) the path (^i[magga]) leading to its cessation. See below, §38, and footnote 112 for references."],
["109",0," ^i[Tatramajjhattatā], “mental balance,” means “keeping in the middle of all things.” Its main characteristic is that it brings about the balance of consciousness and mental factors. It prevents excessiveness on the one hand and deficiency on the other, that is, it puts an end to partiality. Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), p. 208."],
["110",0," For a comprehensive treatment of the ^i[khandhas ]and a discussion of how Buddhist concepts of cognition are both similar to and different from the theories of modern Western cognitive psychology, cf. Jeremy W. Hayward, ^i[Shifting Worlds, Changing Minds: Where the Sciences and Buddhism Meet ](Boston, MA, and London: Shambhala 〔1987〕)."],
["111",0," For a detailed analysis of the aggregates, cf. ^i[Visuddhimaga ]XIV."],
["112",0," The Four Noble Truths are explained in detail in ^i[Visuddhimagga ]XVI and in the Dhammacakkappa- vattana Sutta (no. 56:11), Part V: The Great Book (^i[Mahāvagga]), of the ^i[Saṁyutta Nikāya]. See also Ven.  Dr. Rewata Dhamma, ^i[The  First  Discourse  of  the  Buddha ](Boston, MA: Wisdom Publications 〔1997〕) and Bhikkhu Bodhi (editor), In the Buddha’s Words: An Anthology of Discourses from the Pāḷi Canon (Boston, MA: Wisdom Publications 〔2005〕), The First Discourse, pp. 75—78."],
["113",0," The explanations that follow are based upon ^i[Visuddhimagga ]XVII and ^i[Sammohavinodanī ](Commentary to the ^i[Vibhanga]) XVI."],
["114",0," The sources for these explanations are: ^i[Visuddhimagga ]XVII, 66—100; U Nārada Mahāthera, ^i[Guide to Conditional Relations ](London: Pāḷi Text Society 〔1979〕), 1:8—79; and Ledi Sayādaw, ^i[The Buddhist Philosophy of Relations ](Kandy, Śri Lanka: Buddhist Publication Society 〔reprinted 1986〕), pp. 1—57."],
["115",0," ^i[Javana], literally, “impulsion” (from ^i[javati ]“to impel”), is the phase of full cognition in the cognitive series, or perceptual process (^i[citta-vīthi]), occurring at its climax, if the respective object is large or distinct. It is at this phase that ^i[kamma ]is produced, that is, wholesome or unwholesome volition (^i[cetanā]) concerning the perception that was the object of the previous stages of the respective process of consciousness. There are normally seven impulsive (^i[javana]) moments. In mundane (^i[lokiya]) consciousness, any of the seventeen karmically wholesome (^i[kusala]) classes of consciousness or any of the twelve unwholesome (^i[akusala]) ones may arise at the phase of impulsion. For the Arahant, however, impulsion no longer has a karmic, that is, a rebirth-producing effect, but is a karmically-free function (^i[kiriya ]/ ^i[kriyā]). In addition, there are eight supramundane (^i[lokuttara]) classes of impulsion. Cf. Nyanatiloka, ^i[Buddhist Dictionary:  Manual  of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), pp. 82—83."],
["116",0," The ^i[four great essentials ](^i[mahābhūta]) are the four primary material elements — the earth element (^i[paṭhavī-dhātu]), the water element (^i[āpo-dhātu]), the fire element (^i[tejo-dhātu]), and the air element (^i[vāyo-  dhātu]). These are the fundamental constituents of matter, which are inseparable and which, in their various combinations, enter into the composition of all material substances, from the most minute speck of dust or grain of sand to the most massive mountain. ^i[Derived material phenomena] (^i[upādāya rūpa]) are material phenomena derived from, or dependent upon, the four great essentials. These are twenty-four in number. The great essentials may be compared to the earth, and the derivative phenomena to trees and shrubs that grow in dependence upon the earth. See Chapter 6, §2ff."],
["117",0," One line of the Abhidhamma interpretation adopted by the teachers would restrict the base-object- prenascence support condition to the heart-base arisen at the seventeenth mind-moment preceding the death consciousness, on an occasion when the last ^i[javana ]process takes the heart-base as object. Ledi Sayādaw argues at length in the ^i[Paramatthadīpanī ]against this narrow interpretation, and his position is accepted here."],
["118",0," ^i[Phassa ](from ^i[phusati ]“to touch”) literally means “sense-impression.” Here, it does ^i[not ]signify physical impact but is one of the seven constant mental concomitants of consciousness and belongs to the group of (predisposing) mental formations (^i[saṁkhārakkhandha]). Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), p. 167."],
["119",0," ^i[Bhāva ]literally means “nature” — it refers to the sexual characteristics of the body and belongs to the aggregate of corporeality (^i[rūpakkhandha]). Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), p. 36 and pp. 98—102."],
["120",0," Ledi Sayādaw, ^i[Buddhist Philosophy of Relations], pp. 50—51."],
["121",0,"  ^i[Aṭṭhasālinī   ]392;  ^i[The    Expositor   ]p.  501.   There  is  a  play  on  words  here  that  cannot  be  reproduced  in English: the word ^i[nāma ]“name” or “mind” is derived here from a verbal root ^i[nam- ]meaning “to bend.”"],
["122",0," For more information about the theory of concepts in the Abhidhamma, cf. ^i[Visuddhimagga ]VIII, note 11 (pp. 779—781 in Bhikkhu Ñāṇamoli’s translation). See also Bhikkhu Ñāṇananda, ^i[Concept and Reality in Early Buddhist Thought ](Kandy, Śri Lanka: Buddhist Publication Society 〔1972〕)."],
["123",0," Also called “tranquility meditation,” “calm abiding,” or “stabilizing meditation.”"],
["124",0," Also called “analytical meditation.”"],
["125",0," ^i[Aṭṭhasālinī ]144; ^i[The  Expositor ]p. 191."],
["126",0," Also called ^i[brahmavihāra], the four “sublime abodes” or “divine abodes.”  ^i[Vihāra ]means  “abode”. There are three abodes: (1) the heavenly abode (^i[dibbavihāra]); (2) the divine abode (^i[brahmavihāra]); and (3) the noble abode (^i[ariyavihāra]). Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines] (fourth revised edition 〔1980〕), p. 223."],
["127",0," ^i[Āruppa ]means “formless, immaterial”. It is derived from ^i[arūpa]."],
["128",0," Also called “neighborhood development.”"],
["129",0," Also called “attainment development.”"],
["130",0," Also called “(mental) image.” It will appear in full clarity in the mind by successful practice of certain concentration (^i[samādhi]) exercises."],
["131",0," Also called “preparatory sign” or “preparatory image.”"],
["132",0," Also called “acquired sign” or “acquired image.”"],
["133",0," ^i[Kasiṇa ]is the name for a purely external device used to produce and develop concentration of the mind and attain the four absorptions (^i[jhānas]). It consists in concentrating one’s full and undivided attention on one external visible object until, at last, one perceives, even with the eyes closed, a mental reflex of that object — the “acquired image” (^i[uggahanimitta]). While continuing to direct one’s attention to this image, there may arise the spotless and immovable “counterpart image” (^i[paṭibhāganimitta]) and, together with it, neighborhood concentration (^i[upacārasamādhi]) will have been achieved. While still persevering in concentration on the object, one will finally reach a state of mind in which all sense activity is suspended, where there is no more seeing and hearing, no more perception of bodily impression and feeling, that is, the state of the first meditative absorption (^i[jhāna]). Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), p. 95."],
["134",0," Hence, they are also called “cemetery meditations.”"],
["135",0," The first six recollections are fully explained in the ^i[Visuddhimagga ]VII, and the remaining four in the ^i[Visuddhimagga] VIII."],
["136",0," Also sometimes called “gods,” “^i[devas],” “deities,” or “heavenly beings.”"],
["137",0," These are slightly abbreviated versions of these formulas; for the full versions, cf. Ven. H. Gunaratana, Mahāthera, ^i[Bhāvanā Vandanā: Book of Devotion ](High View, WV: Bhāvanā Society Meditation Center), pp. 34—41."],
["138",0," ^i[Cāga ]means (1) “abandoning, giving up, renunciation”; (2) “(n.) liberality, generosity, munificence; (adj.) generous, munificent.” ^i[Dāna], on the other hand, means “giving, gift,” especially a charitable gift to a ^i[Bhikkhu], a ^i[Bhikkhunī], or the monastic community (the ^i[Sangha])."],
["139",0," The fourth immaterial sphere (^i[arūpāvacana]) absorption, a semi-conscious state, is surpassed only by the temporary complete suspension of consciousness, called “attainment of extinction” (^i[nirodhasamāpatti], also called ^i[saññā-vedayita-nirodha]). The absolutely necessary pre-conditions for its attainment are the perfect mastery of all eight absorptions (^i[jhāna]) as well as the previous attainment of ^i[Anāgāmi ]or Arahatship. Cf. Nyanatiloka, ^i[Buddhist Dictionary: Manual of Buddhist Terms and Doctrines ](fourth revised edition 〔1980〕), p. 123 and pp. 127—128."],
["140",0," That is, to exercise the supernormal power of manifesting a hundred replicas of one’s physical body."],
["141",0,"There are three aspects of ^i[dukkha]: (1) ^i[dukkha dukkha], which is ordinary suffering; (2) ^i[vipariṇāma dukkha], which is suffering experienced by change; and (3) ^i[saṁkhāra dukkha], which is suffering experienced by conditioned states.The first aspect, ^i[dukkha dukkha], contains two components of ordinary suffering. The first refers to life, or being, as it is constituted by mental and material forces (^i[nāma-rūpa]), which are known more specifically as the “five aggregates” (^i[pañcakkhandha]). The Buddha defined these five aggregates as ^i[dukkha]. In other words, the bare fact of life itself is ^i[dukkha]. The second refers to universal maladies. When mental and material forces — the five aggregates — manifest or come into existence, they are bound to be experienced as all kinds of suffering. This is the ^i[dukkha] experienced in birth, sickness, old age, death, association with unloved ones and unpleasant conditions, not getting what one wants, sorrow, lamentation, pain, grief, and despair. In short, ^i[dukkha dukkha] is all kinds of physical and mental suffering that are universally accepted as suffering or pain.\nThe second aspect of suffering is ^i[vipariṇāma dukkha]. ^i[Vipariṇāma] means “change.” It is the nature of this universe that all things constantly change — they are impermanent by nature. Thus, a happy feeling or a happy condition cannot last. When they change, suffering, pain, or unpleasant feelings are the result. “Whatever is impermanent is suffering,” said the Buddha. Whenever one is faced with worldly vicissitudes, one experiences suffering in life. The first two aspects of suffering are easy to understand since they are common experiences in daily life. Because these aspects of suffering are readily recognizable as general experiences, they have typically come to stand for the meaning of ^i[dukkha] referred to in the First Noble Truth. However, this does not convey the full meaning of ^i[dukkha] as the Buddha used the term when referring to the First Noble Truth.\nThe third aspect of suffering, ^i[saṁkhāra dukkha], is the suffering experienced by conditioned states. Everything in the universe, whether physical or mental, is conditioned as well as conditioning. This kind of ^i[dukkha] will be clearly understood through direct experience in ^i[vipassanā] meditation. One who practices ^i[vipassanā] meditation needs to be constantly aware of mental and physical phenomena until he or she directly realizes the ever-changing processes that constitute the universe. Then one will understand ^i[dukkha] as a consequence.\nThis explanation is adapted from ^i[The First Discourse of the Buddha: Turning the Wheel of Dhamma], by Venerable Rewata Dhamma (Boston, MA: Wisdom Publications 〔1997〕), pp. 56—57."],
["142",0," As contrasted with “conventional truth” (^i[vohāra-sacca]) or “commonly-accepted truth” (^i[sammuti-sacca])."],
["143",0," The same high standards are expected of Buddhist nuns, while lay practitioners are expected to adhere to the five precepts and to lead noble and useful lives."],
["144",0," Sarvāstavādin monks observed 253 disciplinary rules, and these are the rules that are currently observed by Tibetan Buddhist monks. The chief tenet of the Sarvāstavādin school was that past, present, and future things really exist. The Third Council, held at Patna around 250 BCE, rejected the Sarvāstavādin position. Chinese monks, on the other hand, observe the 250 disciplinary rules of the Dharmaguptaka school."],
["145",0," Their purpose is merely to sustain life, to provide shelter, and to maintain health so that a Bhikkhu or a Bhikkhunī can devote all of his or her time and effort to spiritual development and to serving others."],
["146",0," For a fuller discussion of the differences between the ^i[samathayāna ]and ^i[vipassanāyāna ]approaches, cf. Ven. Henepola Gunaratana, Mahāthera, ^i[The Jhānas in Theravāda Buddhist Meditation ](Kandy, Śri Lanka: Buddhist Publication Society 〔1988〕), pp. 51—55."],
["147",0,"Buddhism denies the existence of a creator god."],
["148",0," Here, ^i[upaṭṭhāna ]literally means “attending to”."],
["149",0," ^i[Vimokkha ]can be translated as “emancipation,” “deliverance,” or “liberation.”"],
["150",0," ^i[Sotāpanna ]is also translated as “stream-winner.”"],
["151",0," That is, under optimal circumstances for attaining Arahantship."]]